; ModuleID = 'ammp-master/abc.bc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.11.0"

%struct.ABC = type { %struct.ATOM*, %struct.ATOM*, %struct.ATOM*, float, float, float, float, float, i8*, i8*, i8* }
%struct.ATOM = type { float, float, float, float, double, double, double, double, i32, float, float, float, float, float, float, i8*, i8, [9 x i8], float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, [400 x i8*], [64 x i8*], [64 x i8], i32 }
%struct.BOND = type { %struct.ATOM*, %struct.ATOM*, float, float, float, float, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@abc_first = global %struct.ABC* null, align 8
@abc_last = global %struct.ABC* null, align 8
@.str = private unnamed_addr constant [33 x i8] c"undefined atom in abc %d %d %d \00\00", align 1
@bond_first = external global %struct.BOND*
@.str1 = private unnamed_addr constant [31 x i8] c"abc %d %d %d %f %f %f %f %f ;\0A\00", align 1

!0 = !MDCompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (trunk) (https://github.com/jtcriswell/llvm-dsa.git ad8a7d5819f35463224c483b3e1a62dc1cbcf966)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !163, imports: !2)
!1 = !MDFile(filename: "ammp-master/abc.c", directory: "/Users/yangzx/llvm-dsa/projects/poolalloc/tools/leakplug/tests")
!2 = !{}
!3 = !{!4}
!4 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !11, !15, !18, !19, !96, !160}
!6 = !MDSubprogram(name: "abc", scope: !1, file: !1, line: 82, type: !7, isLocal: false, isDefinition: true, scopeLine: 85, isOptimized: false, function: i32 (i32, i32, i32, double, double, double, double, double)* @abc, variables: !2)
!7 = !MDSubroutineType(types: !8)
!8 = !{!9, !9, !9, !9, !10, !10, !10, !10, !10}
!9 = !MDBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !MDBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !MDSubprogram(name: "v_abc", scope: !1, file: !1, line: 130, type: !12, isLocal: false, isDefinition: true, scopeLine: 132, isOptimized: false, function: i32 (float*, double)* @v_abc, variables: !2)
!12 = !MDSubroutineType(types: !13)
!13 = !{!9, !14, !10}
!14 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!15 = !MDSubprogram(name: "do_abc", scope: !1, file: !1, line: 180, type: !16, isLocal: false, isDefinition: true, scopeLine: 182, isOptimized: false, function: i32 (double)* @do_abc, variables: !2)
!16 = !MDSubroutineType(types: !17)
!17 = !{!9, !10}
!18 = !MDSubprogram(name: "f_abc", scope: !1, file: !1, line: 257, type: !16, isLocal: false, isDefinition: true, scopeLine: 260, isOptimized: false, function: i32 (double)* @f_abc, variables: !2)
!19 = !MDSubprogram(name: "get_abc", scope: !1, file: !1, line: 415, type: !20, isLocal: false, isDefinition: true, scopeLine: 418, isOptimized: false, function: void (%struct.ATOM*, %struct.ATOM**, i32, i32*)* @get_abc, variables: !2)
!20 = !MDSubroutineType(types: !21)
!21 = !{null, !22, !94, !9, !95}
!22 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !MDDerivedType(tag: DW_TAG_typedef, name: "ATOM", file: !24, line: 97, baseType: !25)
!24 = !MDFile(filename: "ammp-master/ammp.h", directory: "/Users/yangzx/llvm-dsa/projects/poolalloc/tools/leakplug/tests")
!25 = !MDCompositeType(tag: DW_TAG_structure_type, file: !24, line: 52, size: 32128, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !46, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !87, !91, !93}
!27 = !MDDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !24, line: 53, baseType: !10, size: 32, align: 32)
!28 = !MDDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !24, line: 53, baseType: !10, size: 32, align: 32, offset: 32)
!29 = !MDDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !24, line: 53, baseType: !10, size: 32, align: 32, offset: 64)
!30 = !MDDerivedType(tag: DW_TAG_member, name: "w", scope: !25, file: !24, line: 53, baseType: !10, size: 32, align: 32, offset: 96)
!31 = !MDDerivedType(tag: DW_TAG_member, name: "fx", scope: !25, file: !24, line: 54, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !MDBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!33 = !MDDerivedType(tag: DW_TAG_member, name: "fy", scope: !25, file: !24, line: 54, baseType: !32, size: 64, align: 64, offset: 192)
!34 = !MDDerivedType(tag: DW_TAG_member, name: "fz", scope: !25, file: !24, line: 54, baseType: !32, size: 64, align: 64, offset: 256)
!35 = !MDDerivedType(tag: DW_TAG_member, name: "fw", scope: !25, file: !24, line: 54, baseType: !32, size: 64, align: 64, offset: 320)
!36 = !MDDerivedType(tag: DW_TAG_member, name: "serial", scope: !25, file: !24, line: 55, baseType: !9, size: 32, align: 32, offset: 384)
!37 = !MDDerivedType(tag: DW_TAG_member, name: "q", scope: !25, file: !24, line: 56, baseType: !10, size: 32, align: 32, offset: 416)
!38 = !MDDerivedType(tag: DW_TAG_member, name: "a", scope: !25, file: !24, line: 56, baseType: !10, size: 32, align: 32, offset: 448)
!39 = !MDDerivedType(tag: DW_TAG_member, name: "b", scope: !25, file: !24, line: 56, baseType: !10, size: 32, align: 32, offset: 480)
!40 = !MDDerivedType(tag: DW_TAG_member, name: "mass", scope: !25, file: !24, line: 56, baseType: !10, size: 32, align: 32, offset: 512)
!41 = !MDDerivedType(tag: DW_TAG_member, name: "na", scope: !25, file: !24, line: 57, baseType: !10, size: 32, align: 32, offset: 544)
!42 = !MDDerivedType(tag: DW_TAG_member, name: "rdebye", scope: !25, file: !24, line: 58, baseType: !10, size: 32, align: 32, offset: 576)
!43 = !MDDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !24, line: 59, baseType: !4, size: 64, align: 64, offset: 640)
!44 = !MDDerivedType(tag: DW_TAG_member, name: "active", scope: !25, file: !24, line: 60, baseType: !45, size: 8, align: 8, offset: 704)
!45 = !MDBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !MDDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !24, line: 61, baseType: !47, size: 72, align: 8, offset: 712)
!47 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !45, size: 72, align: 8, elements: !48)
!48 = !{!49}
!49 = !MDSubrange(count: 9)
!50 = !MDDerivedType(tag: DW_TAG_member, name: "chi", scope: !25, file: !24, line: 62, baseType: !10, size: 32, align: 32, offset: 800)
!51 = !MDDerivedType(tag: DW_TAG_member, name: "jaa", scope: !25, file: !24, line: 62, baseType: !10, size: 32, align: 32, offset: 832)
!52 = !MDDerivedType(tag: DW_TAG_member, name: "vx", scope: !25, file: !24, line: 63, baseType: !10, size: 32, align: 32, offset: 864)
!53 = !MDDerivedType(tag: DW_TAG_member, name: "vy", scope: !25, file: !24, line: 63, baseType: !10, size: 32, align: 32, offset: 896)
!54 = !MDDerivedType(tag: DW_TAG_member, name: "vz", scope: !25, file: !24, line: 63, baseType: !10, size: 32, align: 32, offset: 928)
!55 = !MDDerivedType(tag: DW_TAG_member, name: "vw", scope: !25, file: !24, line: 63, baseType: !10, size: 32, align: 32, offset: 960)
!56 = !MDDerivedType(tag: DW_TAG_member, name: "dx", scope: !25, file: !24, line: 63, baseType: !10, size: 32, align: 32, offset: 992)
!57 = !MDDerivedType(tag: DW_TAG_member, name: "dy", scope: !25, file: !24, line: 63, baseType: !10, size: 32, align: 32, offset: 1024)
!58 = !MDDerivedType(tag: DW_TAG_member, name: "dz", scope: !25, file: !24, line: 63, baseType: !10, size: 32, align: 32, offset: 1056)
!59 = !MDDerivedType(tag: DW_TAG_member, name: "dw", scope: !25, file: !24, line: 63, baseType: !10, size: 32, align: 32, offset: 1088)
!60 = !MDDerivedType(tag: DW_TAG_member, name: "gx", scope: !25, file: !24, line: 64, baseType: !10, size: 32, align: 32, offset: 1120)
!61 = !MDDerivedType(tag: DW_TAG_member, name: "gy", scope: !25, file: !24, line: 64, baseType: !10, size: 32, align: 32, offset: 1152)
!62 = !MDDerivedType(tag: DW_TAG_member, name: "gz", scope: !25, file: !24, line: 64, baseType: !10, size: 32, align: 32, offset: 1184)
!63 = !MDDerivedType(tag: DW_TAG_member, name: "gw", scope: !25, file: !24, line: 64, baseType: !10, size: 32, align: 32, offset: 1216)
!64 = !MDDerivedType(tag: DW_TAG_member, name: "VP", scope: !25, file: !24, line: 65, baseType: !10, size: 32, align: 32, offset: 1248)
!65 = !MDDerivedType(tag: DW_TAG_member, name: "px", scope: !25, file: !24, line: 65, baseType: !10, size: 32, align: 32, offset: 1280)
!66 = !MDDerivedType(tag: DW_TAG_member, name: "py", scope: !25, file: !24, line: 65, baseType: !10, size: 32, align: 32, offset: 1312)
!67 = !MDDerivedType(tag: DW_TAG_member, name: "pz", scope: !25, file: !24, line: 65, baseType: !10, size: 32, align: 32, offset: 1344)
!68 = !MDDerivedType(tag: DW_TAG_member, name: "pw", scope: !25, file: !24, line: 65, baseType: !10, size: 32, align: 32, offset: 1376)
!69 = !MDDerivedType(tag: DW_TAG_member, name: "dpx", scope: !25, file: !24, line: 65, baseType: !10, size: 32, align: 32, offset: 1408)
!70 = !MDDerivedType(tag: DW_TAG_member, name: "dpy", scope: !25, file: !24, line: 65, baseType: !10, size: 32, align: 32, offset: 1440)
!71 = !MDDerivedType(tag: DW_TAG_member, name: "dpz", scope: !25, file: !24, line: 65, baseType: !10, size: 32, align: 32, offset: 1472)
!72 = !MDDerivedType(tag: DW_TAG_member, name: "dpw", scope: !25, file: !24, line: 65, baseType: !10, size: 32, align: 32, offset: 1504)
!73 = !MDDerivedType(tag: DW_TAG_member, name: "qxx", scope: !25, file: !24, line: 68, baseType: !10, size: 32, align: 32, offset: 1536)
!74 = !MDDerivedType(tag: DW_TAG_member, name: "qxy", scope: !25, file: !24, line: 68, baseType: !10, size: 32, align: 32, offset: 1568)
!75 = !MDDerivedType(tag: DW_TAG_member, name: "qxz", scope: !25, file: !24, line: 68, baseType: !10, size: 32, align: 32, offset: 1600)
!76 = !MDDerivedType(tag: DW_TAG_member, name: "qyy", scope: !25, file: !24, line: 68, baseType: !10, size: 32, align: 32, offset: 1632)
!77 = !MDDerivedType(tag: DW_TAG_member, name: "qyz", scope: !25, file: !24, line: 68, baseType: !10, size: 32, align: 32, offset: 1664)
!78 = !MDDerivedType(tag: DW_TAG_member, name: "qzz", scope: !25, file: !24, line: 68, baseType: !10, size: 32, align: 32, offset: 1696)
!79 = !MDDerivedType(tag: DW_TAG_member, name: "qxw", scope: !25, file: !24, line: 69, baseType: !10, size: 32, align: 32, offset: 1728)
!80 = !MDDerivedType(tag: DW_TAG_member, name: "qyw", scope: !25, file: !24, line: 69, baseType: !10, size: 32, align: 32, offset: 1760)
!81 = !MDDerivedType(tag: DW_TAG_member, name: "qzw", scope: !25, file: !24, line: 69, baseType: !10, size: 32, align: 32, offset: 1792)
!82 = !MDDerivedType(tag: DW_TAG_member, name: "qww", scope: !25, file: !24, line: 69, baseType: !10, size: 32, align: 32, offset: 1824)
!83 = !MDDerivedType(tag: DW_TAG_member, name: "close", scope: !25, file: !24, line: 86, baseType: !84, size: 25600, align: 64, offset: 1856)
!84 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !4, size: 25600, align: 64, elements: !85)
!85 = !{!86}
!86 = !MDSubrange(count: 400)
!87 = !MDDerivedType(tag: DW_TAG_member, name: "excluded", scope: !25, file: !24, line: 87, baseType: !88, size: 4096, align: 64, offset: 27456)
!88 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4096, align: 64, elements: !89)
!89 = !{!90}
!90 = !MDSubrange(count: 64)
!91 = !MDDerivedType(tag: DW_TAG_member, name: "exkind", scope: !25, file: !24, line: 88, baseType: !92, size: 512, align: 8, offset: 31552)
!92 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, align: 8, elements: !89)
!93 = !MDDerivedType(tag: DW_TAG_member, name: "dontuse", scope: !25, file: !24, line: 96, baseType: !9, size: 32, align: 32, offset: 32064)
!94 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!95 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!96 = !MDSubprogram(name: "dump_abcs", scope: !1, file: !1, line: 447, type: !97, isLocal: false, isDefinition: true, scopeLine: 449, isOptimized: false, function: void (%struct.__sFILE*)* @dump_abcs, variables: !2)
!97 = !MDSubroutineType(types: !98)
!98 = !{null, !99}
!99 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !MDDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !101, line: 153, baseType: !102)
!101 = !MDFile(filename: "/usr/include/stdio.h", directory: "/Users/yangzx/llvm-dsa/projects/poolalloc/tools/leakplug/tests")
!102 = !MDCompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !101, line: 122, size: 1216, align: 64, elements: !103)
!103 = !{!104, !107, !108, !109, !111, !112, !117, !118, !119, !123, !128, !138, !144, !145, !148, !149, !153, !157, !158, !159}
!104 = !MDDerivedType(tag: DW_TAG_member, name: "_p", scope: !102, file: !101, line: 123, baseType: !105, size: 64, align: 64)
!105 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !MDBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!107 = !MDDerivedType(tag: DW_TAG_member, name: "_r", scope: !102, file: !101, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!108 = !MDDerivedType(tag: DW_TAG_member, name: "_w", scope: !102, file: !101, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!109 = !MDDerivedType(tag: DW_TAG_member, name: "_flags", scope: !102, file: !101, line: 126, baseType: !110, size: 16, align: 16, offset: 128)
!110 = !MDBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!111 = !MDDerivedType(tag: DW_TAG_member, name: "_file", scope: !102, file: !101, line: 127, baseType: !110, size: 16, align: 16, offset: 144)
!112 = !MDDerivedType(tag: DW_TAG_member, name: "_bf", scope: !102, file: !101, line: 128, baseType: !113, size: 128, align: 64, offset: 192)
!113 = !MDCompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !101, line: 88, size: 128, align: 64, elements: !114)
!114 = !{!115, !116}
!115 = !MDDerivedType(tag: DW_TAG_member, name: "_base", scope: !113, file: !101, line: 89, baseType: !105, size: 64, align: 64)
!116 = !MDDerivedType(tag: DW_TAG_member, name: "_size", scope: !113, file: !101, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!117 = !MDDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !102, file: !101, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!118 = !MDDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !102, file: !101, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!119 = !MDDerivedType(tag: DW_TAG_member, name: "_close", scope: !102, file: !101, line: 133, baseType: !120, size: 64, align: 64, offset: 448)
!120 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !MDSubroutineType(types: !122)
!122 = !{!9, !4}
!123 = !MDDerivedType(tag: DW_TAG_member, name: "_read", scope: !102, file: !101, line: 134, baseType: !124, size: 64, align: 64, offset: 512)
!124 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !MDSubroutineType(types: !126)
!126 = !{!9, !4, !127, !9}
!127 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!128 = !MDDerivedType(tag: DW_TAG_member, name: "_seek", scope: !102, file: !101, line: 135, baseType: !129, size: 64, align: 64, offset: 576)
!129 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !MDSubroutineType(types: !131)
!131 = !{!132, !4, !132, !9}
!132 = !MDDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !101, line: 77, baseType: !133)
!133 = !MDDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !134, line: 71, baseType: !135)
!134 = !MDFile(filename: "/usr/include/sys/_types.h", directory: "/Users/yangzx/llvm-dsa/projects/poolalloc/tools/leakplug/tests")
!135 = !MDDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !136, line: 46, baseType: !137)
!136 = !MDFile(filename: "/usr/include/i386/_types.h", directory: "/Users/yangzx/llvm-dsa/projects/poolalloc/tools/leakplug/tests")
!137 = !MDBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!138 = !MDDerivedType(tag: DW_TAG_member, name: "_write", scope: !102, file: !101, line: 136, baseType: !139, size: 64, align: 64, offset: 640)
!139 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !MDSubroutineType(types: !141)
!141 = !{!9, !4, !142, !9}
!142 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !MDDerivedType(tag: DW_TAG_const_type, baseType: !45)
!144 = !MDDerivedType(tag: DW_TAG_member, name: "_ub", scope: !102, file: !101, line: 139, baseType: !113, size: 128, align: 64, offset: 704)
!145 = !MDDerivedType(tag: DW_TAG_member, name: "_extra", scope: !102, file: !101, line: 140, baseType: !146, size: 64, align: 64, offset: 832)
!146 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !MDCompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !101, line: 94, flags: DIFlagFwdDecl)
!148 = !MDDerivedType(tag: DW_TAG_member, name: "_ur", scope: !102, file: !101, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!149 = !MDDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !102, file: !101, line: 144, baseType: !150, size: 24, align: 8, offset: 928)
!150 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !106, size: 24, align: 8, elements: !151)
!151 = !{!152}
!152 = !MDSubrange(count: 3)
!153 = !MDDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !102, file: !101, line: 145, baseType: !154, size: 8, align: 8, offset: 952)
!154 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8, align: 8, elements: !155)
!155 = !{!156}
!156 = !MDSubrange(count: 1)
!157 = !MDDerivedType(tag: DW_TAG_member, name: "_lb", scope: !102, file: !101, line: 148, baseType: !113, size: 128, align: 64, offset: 960)
!158 = !MDDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !102, file: !101, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!159 = !MDDerivedType(tag: DW_TAG_member, name: "_offset", scope: !102, file: !101, line: 152, baseType: !132, size: 64, align: 64, offset: 1152)
!160 = !MDSubprogram(name: "a_abc", scope: !1, file: !1, line: 478, type: !161, isLocal: false, isDefinition: true, scopeLine: 482, isOptimized: false, function: i32 (float*, double, i32, i32, %struct.__sFILE*)* @a_abc, variables: !2)
!161 = !MDSubroutineType(types: !162)
!162 = !{!9, !14, !10, !9, !9, !99}
!163 = !{!164, !180}
!164 = !MDGlobalVariable(name: "abc_first", scope: !0, file: !1, line: 73, type: !165, isLocal: false, isDefinition: true, variable: %struct.ABC** @abc_first)
!165 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !MDDerivedType(tag: DW_TAG_typedef, name: "ABC", file: !1, line: 70, baseType: !167)
!167 = !MDCompositeType(tag: DW_TAG_structure_type, file: !1, line: 65, size: 576, align: 64, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!169 = !MDDerivedType(tag: DW_TAG_member, name: "atom1", scope: !167, file: !1, line: 66, baseType: !22, size: 64, align: 64)
!170 = !MDDerivedType(tag: DW_TAG_member, name: "atom2", scope: !167, file: !1, line: 66, baseType: !22, size: 64, align: 64, offset: 64)
!171 = !MDDerivedType(tag: DW_TAG_member, name: "atom3", scope: !167, file: !1, line: 66, baseType: !22, size: 64, align: 64, offset: 128)
!172 = !MDDerivedType(tag: DW_TAG_member, name: "theta", scope: !167, file: !1, line: 67, baseType: !10, size: 32, align: 32, offset: 192)
!173 = !MDDerivedType(tag: DW_TAG_member, name: "thetazero", scope: !167, file: !1, line: 67, baseType: !10, size: 32, align: 32, offset: 224)
!174 = !MDDerivedType(tag: DW_TAG_member, name: "dr", scope: !167, file: !1, line: 67, baseType: !10, size: 32, align: 32, offset: 256)
!175 = !MDDerivedType(tag: DW_TAG_member, name: "dk1", scope: !167, file: !1, line: 67, baseType: !10, size: 32, align: 32, offset: 288)
!176 = !MDDerivedType(tag: DW_TAG_member, name: "dk2", scope: !167, file: !1, line: 67, baseType: !10, size: 32, align: 32, offset: 320)
!177 = !MDDerivedType(tag: DW_TAG_member, name: "b1", scope: !167, file: !1, line: 68, baseType: !4, size: 64, align: 64, offset: 384)
!178 = !MDDerivedType(tag: DW_TAG_member, name: "b2", scope: !167, file: !1, line: 68, baseType: !4, size: 64, align: 64, offset: 448)
!179 = !MDDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !1, line: 69, baseType: !4, size: 64, align: 64, offset: 512)
!180 = !MDGlobalVariable(name: "abc_last", scope: !0, file: !1, line: 74, type: !165, isLocal: false, isDefinition: true, variable: %struct.ABC** @abc_last)
!181 = !{i32 2, !"Dwarf Version", i32 2}
!182 = !{i32 2, !"Debug Info Version", i32 3}
!183 = !{i32 1, !"PIC Level", i32 2}
!184 = !{!"clang version 3.7.0 (trunk) (https://github.com/jtcriswell/llvm-dsa.git ad8a7d5819f35463224c483b3e1a62dc1cbcf966)"}
!185 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "p1", arg: 1, scope: !6, file: !1, line: 83, type: !9)
!186 = !MDExpression()
!187 = !MDLocation(line: 83, column: 5, scope: !6)
!188 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "p2", arg: 2, scope: !6, file: !1, line: 83, type: !9)
!189 = !MDLocation(line: 83, column: 8, scope: !6)
!190 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "p3", arg: 3, scope: !6, file: !1, line: 83, type: !9)
!191 = !MDLocation(line: 83, column: 11, scope: !6)
!192 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "theta", arg: 4, scope: !6, file: !1, line: 84, type: !10)
!193 = !MDLocation(line: 84, column: 7, scope: !6)
!194 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "thetazero", arg: 5, scope: !6, file: !1, line: 84, type: !10)
!195 = !MDLocation(line: 84, column: 14, scope: !6)
!196 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "dr", arg: 6, scope: !6, file: !1, line: 84, type: !10)
!197 = !MDLocation(line: 84, column: 24, scope: !6)
!198 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "dk1", arg: 7, scope: !6, file: !1, line: 84, type: !10)
!199 = !MDLocation(line: 84, column: 27, scope: !6)
!200 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "dk2", arg: 8, scope: !6, file: !1, line: 84, type: !10)
!201 = !MDLocation(line: 84, column: 31, scope: !6)
!202 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !6, file: !1, line: 86, type: !165)
!203 = !MDLocation(line: 86, column: 10, scope: !6)
!204 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ap1", scope: !6, file: !1, line: 87, type: !22)
!205 = !MDLocation(line: 87, column: 11, scope: !6)
!206 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ap2", scope: !6, file: !1, line: 87, type: !22)
!207 = !MDLocation(line: 87, column: 16, scope: !6)
!208 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ap3", scope: !6, file: !1, line: 87, type: !22)
!209 = !MDLocation(line: 87, column: 21, scope: !6)
!210 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !6, file: !1, line: 88, type: !211)
!211 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !45, size: 640, align: 8, elements: !212)
!212 = !{!213}
!213 = !MDSubrange(count: 80)
!214 = !MDLocation(line: 88, column: 10, scope: !6)
!215 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !6, file: !1, line: 89, type: !9)
!216 = !MDLocation(line: 89, column: 9, scope: !6)
!217 = !MDLocation(line: 91, column: 23, scope: !6)
!218 = !MDLocation(line: 91, column: 11, scope: !6)
!219 = !MDLocation(line: 91, column: 9, scope: !6)
!220 = !MDLocation(line: 92, column: 23, scope: !6)
!221 = !MDLocation(line: 92, column: 11, scope: !6)
!222 = !MDLocation(line: 92, column: 9, scope: !6)
!223 = !MDLocation(line: 93, column: 23, scope: !6)
!224 = !MDLocation(line: 93, column: 11, scope: !6)
!225 = !MDLocation(line: 93, column: 9, scope: !6)
!226 = !MDLocation(line: 94, column: 10, scope: !227)
!227 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 94, column: 9)
!228 = !MDLocation(line: 94, column: 14, scope: !227)
!229 = !MDLocation(line: 94, column: 23, scope: !227)
!230 = !MDLocation(line: 94, column: 27, scope: !227)
!231 = !MDLocation(line: 94, column: 31, scope: !227)
!232 = !MDLocation(line: 94, column: 40, scope: !227)
!233 = !MDLocation(line: 94, column: 44, scope: !227)
!234 = !MDLocation(line: 94, column: 47, scope: !227)
!235 = !MDLocation(line: 94, column: 9, scope: !6)
!236 = !MDLocation(line: 96, column: 9, scope: !237)
!237 = distinct !MDLexicalBlock(scope: !227, file: !1, line: 95, column: 5)
!238 = !MDLocation(line: 97, column: 18, scope: !237)
!239 = !MDLocation(line: 97, column: 9, scope: !237)
!240 = !MDLocation(line: 98, column: 9, scope: !237)
!241 = !MDLocation(line: 101, column: 17, scope: !242)
!242 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 101, column: 9)
!243 = !MDLocation(line: 101, column: 15, scope: !242)
!244 = !MDLocation(line: 101, column: 35, scope: !242)
!245 = !MDLocation(line: 101, column: 9, scope: !6)
!246 = !MDLocation(line: 103, column: 9, scope: !247)
!247 = distinct !MDLexicalBlock(scope: !242, file: !1, line: 102, column: 5)
!248 = !MDLocation(line: 106, column: 9, scope: !249)
!249 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 106, column: 9)
!250 = !MDLocation(line: 106, column: 19, scope: !249)
!251 = !MDLocation(line: 106, column: 9, scope: !6)
!252 = !MDLocation(line: 106, column: 40, scope: !249)
!253 = !MDLocation(line: 106, column: 38, scope: !249)
!254 = !MDLocation(line: 106, column: 28, scope: !249)
!255 = !MDLocation(line: 107, column: 9, scope: !256)
!256 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 107, column: 9)
!257 = !MDLocation(line: 107, column: 18, scope: !256)
!258 = !MDLocation(line: 107, column: 9, scope: !6)
!259 = !MDLocation(line: 107, column: 38, scope: !256)
!260 = !MDLocation(line: 107, column: 36, scope: !256)
!261 = !MDLocation(line: 107, column: 27, scope: !256)
!262 = !MDLocation(line: 108, column: 20, scope: !6)
!263 = !MDLocation(line: 108, column: 5, scope: !6)
!264 = !MDLocation(line: 108, column: 12, scope: !6)
!265 = !MDLocation(line: 108, column: 18, scope: !6)
!266 = !MDLocation(line: 109, column: 20, scope: !6)
!267 = !MDLocation(line: 109, column: 5, scope: !6)
!268 = !MDLocation(line: 109, column: 12, scope: !6)
!269 = !MDLocation(line: 109, column: 18, scope: !6)
!270 = !MDLocation(line: 110, column: 20, scope: !6)
!271 = !MDLocation(line: 110, column: 5, scope: !6)
!272 = !MDLocation(line: 110, column: 12, scope: !6)
!273 = !MDLocation(line: 110, column: 18, scope: !6)
!274 = !MDLocation(line: 111, column: 17, scope: !6)
!275 = !MDLocation(line: 111, column: 5, scope: !6)
!276 = !MDLocation(line: 111, column: 12, scope: !6)
!277 = !MDLocation(line: 111, column: 15, scope: !6)
!278 = !MDLocation(line: 112, column: 20, scope: !6)
!279 = !MDLocation(line: 112, column: 5, scope: !6)
!280 = !MDLocation(line: 112, column: 12, scope: !6)
!281 = !MDLocation(line: 112, column: 18, scope: !6)
!282 = !MDLocation(line: 113, column: 24, scope: !6)
!283 = !MDLocation(line: 113, column: 5, scope: !6)
!284 = !MDLocation(line: 113, column: 12, scope: !6)
!285 = !MDLocation(line: 113, column: 22, scope: !6)
!286 = !MDLocation(line: 114, column: 19, scope: !6)
!287 = !MDLocation(line: 114, column: 5, scope: !6)
!288 = !MDLocation(line: 114, column: 12, scope: !6)
!289 = !MDLocation(line: 114, column: 16, scope: !6)
!290 = !MDLocation(line: 115, column: 19, scope: !6)
!291 = !MDLocation(line: 115, column: 5, scope: !6)
!292 = !MDLocation(line: 115, column: 12, scope: !6)
!293 = !MDLocation(line: 115, column: 16, scope: !6)
!294 = !MDLocation(line: 116, column: 5, scope: !6)
!295 = !MDLocation(line: 116, column: 11, scope: !6)
!296 = !MDLocation(line: 116, column: 14, scope: !6)
!297 = !MDLocation(line: 116, column: 23, scope: !6)
!298 = !MDLocation(line: 116, column: 28, scope: !6)
!299 = !MDLocation(line: 116, column: 31, scope: !6)
!300 = !MDLocation(line: 117, column: 19, scope: !6)
!301 = !MDLocation(line: 117, column: 5, scope: !6)
!302 = !MDLocation(line: 117, column: 12, scope: !6)
!303 = !MDLocation(line: 117, column: 17, scope: !6)
!304 = !MDLocation(line: 118, column: 24, scope: !6)
!305 = !MDLocation(line: 118, column: 5, scope: !6)
!306 = !MDLocation(line: 118, column: 17, scope: !6)
!307 = !MDLocation(line: 118, column: 22, scope: !6)
!308 = !MDLocation(line: 119, column: 16, scope: !6)
!309 = !MDLocation(line: 119, column: 14, scope: !6)
!310 = !MDLocation(line: 120, column: 5, scope: !6)
!311 = !MDLocation(line: 121, column: 1, scope: !6)
!312 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "V", arg: 1, scope: !11, file: !1, line: 131, type: !14)
!313 = !MDLocation(line: 131, column: 8, scope: !11)
!314 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 2, scope: !11, file: !1, line: 131, type: !10)
!315 = !MDLocation(line: 131, column: 10, scope: !11)
!316 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "abcp", scope: !11, file: !1, line: 133, type: !165)
!317 = !MDLocation(line: 133, column: 10, scope: !11)
!318 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "bp", scope: !11, file: !1, line: 134, type: !319)
!319 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !MDDerivedType(tag: DW_TAG_typedef, name: "BOND", file: !1, line: 61, baseType: !321)
!321 = !MDCompositeType(tag: DW_TAG_structure_type, file: !1, line: 55, size: 384, align: 64, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330}
!323 = !MDDerivedType(tag: DW_TAG_member, name: "atom1", scope: !321, file: !1, line: 56, baseType: !22, size: 64, align: 64)
!324 = !MDDerivedType(tag: DW_TAG_member, name: "atom2", scope: !321, file: !1, line: 56, baseType: !22, size: 64, align: 64, offset: 64)
!325 = !MDDerivedType(tag: DW_TAG_member, name: "length", scope: !321, file: !1, line: 57, baseType: !10, size: 32, align: 32, offset: 128)
!326 = !MDDerivedType(tag: DW_TAG_member, name: "k", scope: !321, file: !1, line: 57, baseType: !10, size: 32, align: 32, offset: 160)
!327 = !MDDerivedType(tag: DW_TAG_member, name: "dlength", scope: !321, file: !1, line: 58, baseType: !10, size: 32, align: 32, offset: 192)
!328 = !MDDerivedType(tag: DW_TAG_member, name: "dk", scope: !321, file: !1, line: 58, baseType: !10, size: 32, align: 32, offset: 224)
!329 = !MDDerivedType(tag: DW_TAG_member, name: "ndiff", scope: !321, file: !1, line: 59, baseType: !9, size: 32, align: 32, offset: 256)
!330 = !MDDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !1, line: 60, baseType: !4, size: 64, align: 64, offset: 320)
!331 = !MDLocation(line: 134, column: 11, scope: !11)
!332 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !11, file: !1, line: 135, type: !10)
!333 = !MDLocation(line: 135, column: 11, scope: !11)
!334 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "x1", scope: !11, file: !1, line: 135, type: !10)
!335 = !MDLocation(line: 135, column: 13, scope: !11)
!336 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "y1", scope: !11, file: !1, line: 135, type: !10)
!337 = !MDLocation(line: 135, column: 16, scope: !11)
!338 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "z1", scope: !11, file: !1, line: 135, type: !10)
!339 = !MDLocation(line: 135, column: 19, scope: !11)
!340 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "keff", scope: !11, file: !1, line: 136, type: !10)
!341 = !MDLocation(line: 136, column: 11, scope: !11)
!342 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "length_eff", scope: !11, file: !1, line: 136, type: !10)
!343 = !MDLocation(line: 136, column: 16, scope: !11)
!344 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !11, file: !1, line: 137, type: !22)
!345 = !MDLocation(line: 137, column: 11, scope: !11)
!346 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !11, file: !1, line: 137, type: !22)
!347 = !MDLocation(line: 137, column: 15, scope: !11)
!348 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "a3", scope: !11, file: !1, line: 137, type: !22)
!349 = !MDLocation(line: 137, column: 19, scope: !11)
!350 = !MDLocation(line: 140, column: 12, scope: !11)
!351 = !MDLocation(line: 140, column: 10, scope: !11)
!352 = !MDLocation(line: 141, column: 9, scope: !353)
!353 = distinct !MDLexicalBlock(scope: !11, file: !1, line: 141, column: 9)
!354 = !MDLocation(line: 141, column: 14, scope: !353)
!355 = !MDLocation(line: 141, column: 9, scope: !11)
!356 = !MDLocation(line: 141, column: 40, scope: !357)
!357 = distinct !MDLexicalBlock(scope: !353, file: !1, line: 141, column: 23)
!358 = !MDLocation(line: 141, column: 42, scope: !357)
!359 = !MDLocation(line: 141, column: 32, scope: !357)
!360 = !MDLocation(line: 141, column: 25, scope: !357)
!361 = !MDLocation(line: 142, column: 10, scope: !11)
!362 = !MDLocation(line: 142, column: 8, scope: !11)
!363 = !MDLocation(line: 143, column: 9, scope: !364)
!364 = distinct !MDLexicalBlock(scope: !11, file: !1, line: 143, column: 9)
!365 = !MDLocation(line: 143, column: 12, scope: !364)
!366 = !MDLocation(line: 143, column: 9, scope: !11)
!367 = !MDLocation(line: 143, column: 22, scope: !364)
!368 = !MDLocation(line: 145, column: 13, scope: !11)
!369 = !MDLocation(line: 145, column: 5, scope: !11)
!370 = !MDLocation(line: 148, column: 5, scope: !11)
!371 = !MDLocation(line: 150, column: 12, scope: !372)
!372 = distinct !MDLexicalBlock(scope: !373, file: !1, line: 150, column: 12)
!373 = distinct !MDLexicalBlock(scope: !11, file: !1, line: 149, column: 5)
!374 = !MDLocation(line: 150, column: 15, scope: !372)
!375 = !MDLocation(line: 150, column: 12, scope: !373)
!376 = !MDLocation(line: 150, column: 24, scope: !372)
!377 = !MDLocation(line: 151, column: 14, scope: !373)
!378 = !MDLocation(line: 151, column: 18, scope: !373)
!379 = !MDLocation(line: 151, column: 12, scope: !373)
!380 = !MDLocation(line: 151, column: 30, scope: !373)
!381 = !MDLocation(line: 151, column: 34, scope: !373)
!382 = !MDLocation(line: 151, column: 28, scope: !373)
!383 = !MDLocation(line: 152, column: 13, scope: !384)
!384 = distinct !MDLexicalBlock(scope: !373, file: !1, line: 152, column: 13)
!385 = !MDLocation(line: 152, column: 17, scope: !384)
!386 = !MDLocation(line: 152, column: 24, scope: !384)
!387 = !MDLocation(line: 152, column: 27, scope: !384)
!388 = !MDLocation(line: 152, column: 31, scope: !384)
!389 = !MDLocation(line: 152, column: 13, scope: !373)
!390 = !MDLocation(line: 153, column: 19, scope: !391)
