; ModuleID = 'ammp-master/rectmm.bc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.11.0"

%struct.ATOM = type { float, float, float, float, double, double, double, double, i32, float, float, float, float, float, float, i8*, i8, [9 x i8], float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, [400 x i8*], [64 x i8*], [64 x i8], i32 }
%struct.MMNODE = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, i32, i32, i32 }
%struct.MMATOM = type { %struct.ATOM*, i32, i32 }

@.str = private unnamed_addr constant [6 x i8] c"mmbox\00", align 1
@.str1 = private unnamed_addr constant [6 x i8] c"mxcut\00", align 1
@.str2 = private unnamed_addr constant [7 x i8] c"dielec\00", align 1
@.str3 = private unnamed_addr constant [40 x i8] c"cannot allocate memory in mm_fv_update\0A\00", align 1
@.str4 = private unnamed_addr constant [62 x i8] c"cannot allocate node memory in mm_fv_update (doubling grid )\0A\00", align 1
@.str5 = private unnamed_addr constant [28 x i8] c"mmbox %f nx %d ny %d nz %d \00", align 1
@.str6 = private unnamed_addr constant [49 x i8] c" xmin xmax %f %f ymin ymax %f %f zmin zmax %f %f\00", align 1

!17 = !MDLocation(line: 83, column: 7, scope: !6)
!18 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !6, file: !1, line: 85, type: !10)
!19 = !MDLocation(line: 85, column: 11, scope: !6)
!20 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "r0", scope: !6, file: !1, line: 85, type: !10)
!21 = !MDLocation(line: 85, column: 13, scope: !6)
!22 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "xt", scope: !6, file: !1, line: 85, type: !10)
!23 = !MDLocation(line: 85, column: 16, scope: !6)
!24 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "yt", scope: !6, file: !1, line: 85, type: !10)
!25 = !MDLocation(line: 85, column: 19, scope: !6)
!26 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "zt", scope: !6, file: !1, line: 85, type: !10)
!27 = !MDLocation(line: 85, column: 22, scope: !6)
!28 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "xt2", scope: !6, file: !1, line: 86, type: !10)
!29 = !MDLocation(line: 86, column: 11, scope: !6)
!30 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "xt3", scope: !6, file: !1, line: 86, type: !10)
!31 = !MDLocation(line: 86, column: 15, scope: !6)
!32 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "xt4", scope: !6, file: !1, line: 86, type: !10)
!33 = !MDLocation(line: 86, column: 19, scope: !6)
!34 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "yt2", scope: !6, file: !1, line: 86, type: !10)
!35 = !MDLocation(line: 86, column: 23, scope: !6)
!36 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "yt3", scope: !6, file: !1, line: 86, type: !10)
!37 = !MDLocation(line: 86, column: 27, scope: !6)
!38 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "yt4", scope: !6, file: !1, line: 86, type: !10)
!39 = !MDLocation(line: 86, column: 31, scope: !6)
!40 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "zt2", scope: !6, file: !1, line: 86, type: !10)
!41 = !MDLocation(line: 86, column: 35, scope: !6)
!42 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "zt3", scope: !6, file: !1, line: 86, type: !10)
!43 = !MDLocation(line: 86, column: 39, scope: !6)
!44 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "zt4", scope: !6, file: !1, line: 86, type: !10)
!45 = !MDLocation(line: 86, column: 43, scope: !6)
!46 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !6, file: !1, line: 87, type: !10)
!47 = !MDLocation(line: 87, column: 11, scope: !6)
!48 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "k1", scope: !6, file: !1, line: 87, type: !10)
!49 = !MDLocation(line: 87, column: 13, scope: !6)
!50 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "k2", scope: !6, file: !1, line: 87, type: !10)
!51 = !MDLocation(line: 87, column: 16, scope: !6)
!52 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "k3", scope: !6, file: !1, line: 87, type: !10)
!53 = !MDLocation(line: 87, column: 19, scope: !6)
!54 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "k4", scope: !6, file: !1, line: 87, type: !10)
!55 = !MDLocation(line: 87, column: 22, scope: !6)
!56 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "k5", scope: !6, file: !1, line: 87, type: !10)
!57 = !MDLocation(line: 87, column: 25, scope: !6)
!58 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ka2", scope: !6, file: !1, line: 88, type: !10)
!59 = !MDLocation(line: 88, column: 11, scope: !6)
!60 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ka3", scope: !6, file: !1, line: 88, type: !10)
!61 = !MDLocation(line: 88, column: 15, scope: !6)
!62 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "kb2", scope: !6, file: !1, line: 89, type: !10)
!63 = !MDLocation(line: 89, column: 11, scope: !6)
!64 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "kb3", scope: !6, file: !1, line: 89, type: !10)
!65 = !MDLocation(line: 89, column: 15, scope: !6)
!66 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !6, file: !1, line: 90, type: !10)
!67 = !MDLocation(line: 90, column: 11, scope: !6)
!68 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !6, file: !1, line: 90, type: !10)
!69 = !MDLocation(line: 90, column: 14, scope: !6)
!70 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "c3", scope: !6, file: !1, line: 90, type: !10)
!71 = !MDLocation(line: 90, column: 17, scope: !6)
!72 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "c4", scope: !6, file: !1, line: 90, type: !10)
!73 = !MDLocation(line: 90, column: 20, scope: !6)
!74 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "c5", scope: !6, file: !1, line: 90, type: !10)
!75 = !MDLocation(line: 90, column: 23, scope: !6)
!76 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "inbond", scope: !6, file: !1, line: 92, type: !9)
!77 = !MDLocation(line: 92, column: 9, scope: !6)
!78 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "inangle", scope: !6, file: !1, line: 92, type: !9)
!79 = !MDLocation(line: 92, column: 16, scope: !6)
!80 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !6, file: !1, line: 92, type: !9)
!81 = !MDLocation(line: 92, column: 24, scope: !6)
!82 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !6, file: !1, line: 93, type: !83)
!83 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !MDDerivedType(tag: DW_TAG_typedef, name: "ATOM", file: !85, line: 97, baseType: !86)
!85 = !MDFile(filename: "ammp-master/ammp.h", directory: "/Users/yangzx/llvm-dsa/projects/poolalloc/tools/leakplug/tests")
!86 = !MDCompositeType(tag: DW_TAG_structure_type, file: !85, line: 52, size: 32128, align: 64, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !107, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !148, !152, !154}
!88 = !MDDerivedType(tag: DW_TAG_member, name: "x", scope: !86, file: !85, line: 53, baseType: !10, size: 32, align: 32)
!89 = !MDDerivedType(tag: DW_TAG_member, name: "y", scope: !86, file: !85, line: 53, baseType: !10, size: 32, align: 32, offset: 32)
!90 = !MDDerivedType(tag: DW_TAG_member, name: "z", scope: !86, file: !85, line: 53, baseType: !10, size: 32, align: 32, offset: 64)
!91 = !MDDerivedType(tag: DW_TAG_member, name: "w", scope: !86, file: !85, line: 53, baseType: !10, size: 32, align: 32, offset: 96)
!92 = !MDDerivedType(tag: DW_TAG_member, name: "fx", scope: !86, file: !85, line: 54, baseType: !93, size: 64, align: 64, offset: 128)
!93 = !MDBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!94 = !MDDerivedType(tag: DW_TAG_member, name: "fy", scope: !86, file: !85, line: 54, baseType: !93, size: 64, align: 64, offset: 192)
!95 = !MDDerivedType(tag: DW_TAG_member, name: "fz", scope: !86, file: !85, line: 54, baseType: !93, size: 64, align: 64, offset: 256)
!96 = !MDDerivedType(tag: DW_TAG_member, name: "fw", scope: !86, file: !85, line: 54, baseType: !93, size: 64, align: 64, offset: 320)
!97 = !MDDerivedType(tag: DW_TAG_member, name: "serial", scope: !86, file: !85, line: 55, baseType: !9, size: 32, align: 32, offset: 384)
!98 = !MDDerivedType(tag: DW_TAG_member, name: "q", scope: !86, file: !85, line: 56, baseType: !10, size: 32, align: 32, offset: 416)
!99 = !MDDerivedType(tag: DW_TAG_member, name: "a", scope: !86, file: !85, line: 56, baseType: !10, size: 32, align: 32, offset: 448)
!100 = !MDDerivedType(tag: DW_TAG_member, name: "b", scope: !86, file: !85, line: 56, baseType: !10, size: 32, align: 32, offset: 480)
!101 = !MDDerivedType(tag: DW_TAG_member, name: "mass", scope: !86, file: !85, line: 56, baseType: !10, size: 32, align: 32, offset: 512)
!102 = !MDDerivedType(tag: DW_TAG_member, name: "na", scope: !86, file: !85, line: 57, baseType: !10, size: 32, align: 32, offset: 544)
!103 = !MDDerivedType(tag: DW_TAG_member, name: "rdebye", scope: !86, file: !85, line: 58, baseType: !10, size: 32, align: 32, offset: 576)
!104 = !MDDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !85, line: 59, baseType: !4, size: 64, align: 64, offset: 640)
!105 = !MDDerivedType(tag: DW_TAG_member, name: "active", scope: !86, file: !85, line: 60, baseType: !106, size: 8, align: 8, offset: 704)
!106 = !MDBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!107 = !MDDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !85, line: 61, baseType: !108, size: 72, align: 8, offset: 712)
!108 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !106, size: 72, align: 8, elements: !109)
!109 = !{!110}
!110 = !MDSubrange(count: 9)
!111 = !MDDerivedType(tag: DW_TAG_member, name: "chi", scope: !86, file: !85, line: 62, baseType: !10, size: 32, align: 32, offset: 800)
!112 = !MDDerivedType(tag: DW_TAG_member, name: "jaa", scope: !86, file: !85, line: 62, baseType: !10, size: 32, align: 32, offset: 832)
!113 = !MDDerivedType(tag: DW_TAG_member, name: "vx", scope: !86, file: !85, line: 63, baseType: !10, size: 32, align: 32, offset: 864)
!114 = !MDDerivedType(tag: DW_TAG_member, name: "vy", scope: !86, file: !85, line: 63, baseType: !10, size: 32, align: 32, offset: 896)
!115 = !MDDerivedType(tag: DW_TAG_member, name: "vz", scope: !86, file: !85, line: 63, baseType: !10, size: 32, align: 32, offset: 928)
!116 = !MDDerivedType(tag: DW_TAG_member, name: "vw", scope: !86, file: !85, line: 63, baseType: !10, size: 32, align: 32, offset: 960)
!117 = !MDDerivedType(tag: DW_TAG_member, name: "dx", scope: !86, file: !85, line: 63, baseType: !10, size: 32, align: 32, offset: 992)
!118 = !MDDerivedType(tag: DW_TAG_member, name: "dy", scope: !86, file: !85, line: 63, baseType: !10, size: 32, align: 32, offset: 1024)
!119 = !MDDerivedType(tag: DW_TAG_member, name: "dz", scope: !86, file: !85, line: 63, baseType: !10, size: 32, align: 32, offset: 1056)
!120 = !MDDerivedType(tag: DW_TAG_member, name: "dw", scope: !86, file: !85, line: 63, baseType: !10, size: 32, align: 32, offset: 1088)
!121 = !MDDerivedType(tag: DW_TAG_member, name: "gx", scope: !86, file: !85, line: 64, baseType: !10, size: 32, align: 32, offset: 1120)
!122 = !MDDerivedType(tag: DW_TAG_member, name: "gy", scope: !86, file: !85, line: 64, baseType: !10, size: 32, align: 32, offset: 1152)
!123 = !MDDerivedType(tag: DW_TAG_member, name: "gz", scope: !86, file: !85, line: 64, baseType: !10, size: 32, align: 32, offset: 1184)
!124 = !MDDerivedType(tag: DW_TAG_member, name: "gw", scope: !86, file: !85, line: 64, baseType: !10, size: 32, align: 32, offset: 1216)
!125 = !MDDerivedType(tag: DW_TAG_member, name: "VP", scope: !86, file: !85, line: 65, baseType: !10, size: 32, align: 32, offset: 1248)
!126 = !MDDerivedType(tag: DW_TAG_member, name: "px", scope: !86, file: !85, line: 65, baseType: !10, size: 32, align: 32, offset: 1280)
!127 = !MDDerivedType(tag: DW_TAG_member, name: "py", scope: !86, file: !85, line: 65, baseType: !10, size: 32, align: 32, offset: 1312)
!128 = !MDDerivedType(tag: DW_TAG_member, name: "pz", scope: !86, file: !85, line: 65, baseType: !10, size: 32, align: 32, offset: 1344)
!129 = !MDDerivedType(tag: DW_TAG_member, name: "pw", scope: !86, file: !85, line: 65, baseType: !10, size: 32, align: 32, offset: 1376)
!130 = !MDDerivedType(tag: DW_TAG_member, name: "dpx", scope: !86, file: !85, line: 65, baseType: !10, size: 32, align: 32, offset: 1408)
!131 = !MDDerivedType(tag: DW_TAG_member, name: "dpy", scope: !86, file: !85, line: 65, baseType: !10, size: 32, align: 32, offset: 1440)
!132 = !MDDerivedType(tag: DW_TAG_member, name: "dpz", scope: !86, file: !85, line: 65, baseType: !10, size: 32, align: 32, offset: 1472)
!133 = !MDDerivedType(tag: DW_TAG_member, name: "dpw", scope: !86, file: !85, line: 65, baseType: !10, size: 32, align: 32, offset: 1504)
!134 = !MDDerivedType(tag: DW_TAG_member, name: "qxx", scope: !86, file: !85, line: 68, baseType: !10, size: 32, align: 32, offset: 1536)
!135 = !MDDerivedType(tag: DW_TAG_member, name: "qxy", scope: !86, file: !85, line: 68, baseType: !10, size: 32, align: 32, offset: 1568)
!136 = !MDDerivedType(tag: DW_TAG_member, name: "qxz", scope: !86, file: !85, line: 68, baseType: !10, size: 32, align: 32, offset: 1600)
!137 = !MDDerivedType(tag: DW_TAG_member, name: "qyy", scope: !86, file: !85, line: 68, baseType: !10, size: 32, align: 32, offset: 1632)
!138 = !MDDerivedType(tag: DW_TAG_member, name: "qyz", scope: !86, file: !85, line: 68, baseType: !10, size: 32, align: 32, offset: 1664)
!139 = !MDDerivedType(tag: DW_TAG_member, name: "qzz", scope: !86, file: !85, line: 68, baseType: !10, size: 32, align: 32, offset: 1696)
!140 = !MDDerivedType(tag: DW_TAG_member, name: "qxw", scope: !86, file: !85, line: 69, baseType: !10, size: 32, align: 32, offset: 1728)
!141 = !MDDerivedType(tag: DW_TAG_member, name: "qyw", scope: !86, file: !85, line: 69, baseType: !10, size: 32, align: 32, offset: 1760)
!142 = !MDDerivedType(tag: DW_TAG_member, name: "qzw", scope: !86, file: !85, line: 69, baseType: !10, size: 32, align: 32, offset: 1792)
!143 = !MDDerivedType(tag: DW_TAG_member, name: "qww", scope: !86, file: !85, line: 69, baseType: !10, size: 32, align: 32, offset: 1824)
!144 = !MDDerivedType(tag: DW_TAG_member, name: "close", scope: !86, file: !85, line: 86, baseType: !145, size: 25600, align: 64, offset: 1856)
!145 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !4, size: 25600, align: 64, elements: !146)
!146 = !{!147}
!147 = !MDSubrange(count: 400)
!148 = !MDDerivedType(tag: DW_TAG_member, name: "excluded", scope: !86, file: !85, line: 87, baseType: !149, size: 4096, align: 64, offset: 27456)
!149 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4096, align: 64, elements: !150)
!150 = !{!151}
!151 = !MDSubrange(count: 64)
!152 = !MDDerivedType(tag: DW_TAG_member, name: "exkind", scope: !86, file: !85, line: 88, baseType: !153, size: 512, align: 8, offset: 31552)
!153 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !106, size: 512, align: 8, elements: !150)
!154 = !MDDerivedType(tag: DW_TAG_member, name: "dontuse", scope: !86, file: !85, line: 96, baseType: !9, size: 32, align: 32, offset: 32064)
!155 = !MDLocation(line: 93, column: 11, scope: !6)
!156 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !6, file: !1, line: 93, type: !83)
!157 = !MDLocation(line: 93, column: 15, scope: !6)
!158 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !6, file: !1, line: 93, type: !83)
!159 = !MDLocation(line: 93, column: 19, scope: !6)
!160 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "bonded", scope: !6, file: !1, line: 93, type: !161)
!161 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !83, size: 640, align: 64, elements: !162)
!162 = !{!163}
!163 = !MDSubrange(count: 10)
!164 = !MDLocation(line: 93, column: 23, scope: !6)
!165 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "angled", scope: !6, file: !1, line: 93, type: !161)
!166 = !MDLocation(line: 93, column: 35, scope: !6)
!167 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 96, type: !9)
!168 = !MDLocation(line: 96, column: 9, scope: !6)
!169 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !6, file: !1, line: 96, type: !9)
!170 = !MDLocation(line: 96, column: 12, scope: !6)
!171 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !6, file: !1, line: 96, type: !9)
!172 = !MDLocation(line: 96, column: 14, scope: !6)
!173 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "imax", scope: !6, file: !1, line: 96, type: !9)
!174 = !MDLocation(line: 96, column: 17, scope: !6)
!175 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "inclose", scope: !6, file: !1, line: 96, type: !9)
!176 = !MDLocation(line: 96, column: 22, scope: !6)
!177 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "vector", scope: !6, file: !1, line: 97, type: !178)
!178 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !10, align: 32, elements: !180)
!180 = !{!181}
!181 = !MDSubrange(count: -1)
!182 = !MDLocation(line: 97, column: 13, scope: !6)
!183 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "close", scope: !6, file: !1, line: 99, type: !184)
!184 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !83, size: 25600, align: 64, elements: !146)
!185 = !MDLocation(line: 99, column: 11, scope: !6)
!186 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "atomall", scope: !6, file: !1, line: 99, type: !187)
!187 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !83, align: 64, elements: !180)
!189 = !MDLocation(line: 99, column: 28, scope: !6)
!190 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "mxdq", scope: !6, file: !1, line: 100, type: !10)
!191 = !MDLocation(line: 100, column: 11, scope: !6)
!192 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "dielectric", scope: !6, file: !1, line: 100, type: !10)
!193 = !MDLocation(line: 100, column: 16, scope: !6)
!194 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "mxcut", scope: !6, file: !1, line: 100, type: !10)
!195 = !MDLocation(line: 100, column: 27, scope: !6)
!196 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "mmbox", scope: !6, file: !1, line: 101, type: !10)
!197 = !MDLocation(line: 101, column: 11, scope: !6)
!198 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "xmax", scope: !6, file: !1, line: 102, type: !10)
!199 = !MDLocation(line: 102, column: 11, scope: !6)
!200 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "xmin", scope: !6, file: !1, line: 102, type: !10)
!201 = !MDLocation(line: 102, column: 16, scope: !6)
!202 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ymax", scope: !6, file: !1, line: 102, type: !10)
!203 = !MDLocation(line: 102, column: 21, scope: !6)
!204 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ymin", scope: !6, file: !1, line: 102, type: !10)
!205 = !MDLocation(line: 102, column: 26, scope: !6)
!206 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "zmax", scope: !6, file: !1, line: 102, type: !10)
!207 = !MDLocation(line: 102, column: 31, scope: !6)
!208 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "zmin", scope: !6, file: !1, line: 102, type: !10)
!209 = !MDLocation(line: 102, column: 36, scope: !6)
!210 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !6, file: !1, line: 103, type: !9)
!211 = !MDLocation(line: 103, column: 9, scope: !6)
!212 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !6, file: !1, line: 103, type: !9)
!213 = !MDLocation(line: 103, column: 12, scope: !6)
!214 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !6, file: !1, line: 103, type: !9)
!215 = !MDLocation(line: 103, column: 15, scope: !6)
!216 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !6, file: !1, line: 104, type: !9)
!217 = !MDLocation(line: 104, column: 9, scope: !6)
!218 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !6, file: !1, line: 104, type: !9)
!219 = !MDLocation(line: 104, column: 12, scope: !6)
!220 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !6, file: !1, line: 104, type: !9)
!221 = !MDLocation(line: 104, column: 15, scope: !6)
!222 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "inode", scope: !6, file: !1, line: 104, type: !9)
!223 = !MDLocation(line: 104, column: 18, scope: !6)
!224 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "naybor", scope: !6, file: !1, line: 105, type: !225)
!225 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !9, size: 864, align: 32, elements: !226)
!226 = !{!227}
!227 = !MDSubrange(count: 27)
!228 = !MDLocation(line: 105, column: 9, scope: !6)
!229 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !6, file: !1, line: 106, type: !230)
!230 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !106, size: 640, align: 8, elements: !231)
!231 = !{!232}
!232 = !MDSubrange(count: 80)
!233 = !MDLocation(line: 106, column: 10, scope: !6)
!234 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "nodelist", scope: !6, file: !1, line: 107, type: !235)
!235 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !237, align: 32, elements: !180)
!237 = !MDDerivedType(tag: DW_TAG_typedef, name: "MMNODE", file: !1, line: 78, baseType: !238)
!238 = !MDCompositeType(tag: DW_TAG_structure_type, file: !1, line: 64, size: 960, align: 32, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!240 = !MDDerivedType(tag: DW_TAG_member, name: "xc", scope: !238, file: !1, line: 65, baseType: !10, size: 32, align: 32)
!241 = !MDDerivedType(tag: DW_TAG_member, name: "yc", scope: !238, file: !1, line: 65, baseType: !10, size: 32, align: 32, offset: 32)
!242 = !MDDerivedType(tag: DW_TAG_member, name: "zc", scope: !238, file: !1, line: 65, baseType: !10, size: 32, align: 32, offset: 64)
!243 = !MDDerivedType(tag: DW_TAG_member, name: "sqp", scope: !238, file: !1, line: 66, baseType: !10, size: 32, align: 32, offset: 96)
!244 = !MDDerivedType(tag: DW_TAG_member, name: "sa", scope: !238, file: !1, line: 68, baseType: !10, size: 32, align: 32, offset: 128)
!245 = !MDDerivedType(tag: DW_TAG_member, name: "xa", scope: !238, file: !1, line: 68, baseType: !10, size: 32, align: 32, offset: 160)
!246 = !MDDerivedType(tag: DW_TAG_member, name: "ya", scope: !238, file: !1, line: 68, baseType: !10, size: 32, align: 32, offset: 192)
!247 = !MDDerivedType(tag: DW_TAG_member, name: "za", scope: !238, file: !1, line: 68, baseType: !10, size: 32, align: 32, offset: 224)
!248 = !MDDerivedType(tag: DW_TAG_member, name: "q100", scope: !238, file: !1, line: 69, baseType: !10, size: 32, align: 32, offset: 256)
!249 = !MDDerivedType(tag: DW_TAG_member, name: "q010", scope: !238, file: !1, line: 69, baseType: !10, size: 32, align: 32, offset: 288)
!250 = !MDDerivedType(tag: DW_TAG_member, name: "q001", scope: !238, file: !1, line: 69, baseType: !10, size: 32, align: 32, offset: 320)
!251 = !MDDerivedType(tag: DW_TAG_member, name: "q200", scope: !238, file: !1, line: 70, baseType: !10, size: 32, align: 32, offset: 352)
!252 = !MDDerivedType(tag: DW_TAG_member, name: "q020", scope: !238, file: !1, line: 70, baseType: !10, size: 32, align: 32, offset: 384)
!253 = !MDDerivedType(tag: DW_TAG_member, name: "q002", scope: !238, file: !1, line: 70, baseType: !10, size: 32, align: 32, offset: 416)
!254 = !MDDerivedType(tag: DW_TAG_member, name: "q110", scope: !238, file: !1, line: 70, baseType: !10, size: 32, align: 32, offset: 448)
!255 = !MDDerivedType(tag: DW_TAG_member, name: "q101", scope: !238, file: !1, line: 70, baseType: !10, size: 32, align: 32, offset: 480)
!256 = !MDDerivedType(tag: DW_TAG_member, name: "q011", scope: !238, file: !1, line: 70, baseType: !10, size: 32, align: 32, offset: 512)
!257 = !MDDerivedType(tag: DW_TAG_member, name: "q300", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 544)
!258 = !MDDerivedType(tag: DW_TAG_member, name: "q030", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 576)
!259 = !MDDerivedType(tag: DW_TAG_member, name: "q003", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 608)
!260 = !MDDerivedType(tag: DW_TAG_member, name: "q210", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 640)
!261 = !MDDerivedType(tag: DW_TAG_member, name: "q201", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 672)
!262 = !MDDerivedType(tag: DW_TAG_member, name: "q120", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 704)
!263 = !MDDerivedType(tag: DW_TAG_member, name: "q021", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 736)
!264 = !MDDerivedType(tag: DW_TAG_member, name: "q102", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 768)
!265 = !MDDerivedType(tag: DW_TAG_member, name: "q012", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 800)
!266 = !MDDerivedType(tag: DW_TAG_member, name: "q111", scope: !238, file: !1, line: 71, baseType: !10, size: 32, align: 32, offset: 832)
!267 = !MDDerivedType(tag: DW_TAG_member, name: "first", scope: !238, file: !1, line: 78, baseType: !9, size: 32, align: 32, offset: 864)
!268 = !MDDerivedType(tag: DW_TAG_member, name: "last", scope: !238, file: !1, line: 78, baseType: !9, size: 32, align: 32, offset: 896)
!269 = !MDDerivedType(tag: DW_TAG_member, name: "innode", scope: !238, file: !1, line: 78, baseType: !9, size: 32, align: 32, offset: 928)
!270 = !MDLocation(line: 107, column: 14, scope: !6)
!271 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "atomlist", scope: !6, file: !1, line: 108, type: !272)
!272 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !274, align: 64, elements: !180)
!274 = !MDDerivedType(tag: DW_TAG_typedef, name: "MMATOM", file: !1, line: 81, baseType: !275)
!275 = !MDCompositeType(tag: DW_TAG_structure_type, file: !1, line: 79, size: 128, align: 64, elements: !276)
!276 = !{!277, !278, !279}
!277 = !MDDerivedType(tag: DW_TAG_member, name: "who", scope: !275, file: !1, line: 80, baseType: !83, size: 64, align: 64)
!278 = !MDDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !1, line: 81, baseType: !9, size: 32, align: 32, offset: 64)
!279 = !MDDerivedType(tag: DW_TAG_member, name: "which", scope: !275, file: !1, line: 81, baseType: !9, size: 32, align: 32, offset: 96)
!280 = !MDLocation(line: 108, column: 14, scope: !6)
!281 = !MDLocation(line: 111, column: 13, scope: !6)
!282 = !MDLocation(line: 111, column: 11, scope: !6)
!283 = !MDLocation(line: 112, column: 13, scope: !6)
!284 = !MDLocation(line: 112, column: 11, scope: !6)
!285 = !MDLocation(line: 113, column: 9, scope: !286)
!286 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 113, column: 9)
!287 = !MDLocation(line: 113, column: 15, scope: !286)
!288 = !MDLocation(line: 113, column: 9, scope: !6)
!289 = !MDLocation(line: 113, column: 26, scope: !286)
!290 = !MDLocation(line: 113, column: 21, scope: !286)
!291 = !MDLocation(line: 115, column: 18, scope: !6)
!292 = !MDLocation(line: 115, column: 16, scope: !6)
!293 = !MDLocation(line: 116, column: 9, scope: !294)
!294 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 116, column: 9)
!295 = !MDLocation(line: 116, column: 20, scope: !294)
!296 = !MDLocation(line: 116, column: 9, scope: !6)
!297 = !MDLocation(line: 116, column: 38, scope: !294)
!298 = !MDLocation(line: 116, column: 27, scope: !294)
!299 = !MDLocation(line: 117, column: 28, scope: !6)
!300 = !MDLocation(line: 117, column: 27, scope: !6)
!301 = !MDLocation(line: 117, column: 18, scope: !6)
!302 = !MDLocation(line: 117, column: 16, scope: !6)
!303 = !MDLocation(line: 120, column: 9, scope: !6)
!304 = !MDLocation(line: 120, column: 7, scope: !6)
!305 = !MDLocation(line: 121, column: 24, scope: !6)
!306 = !MDLocation(line: 121, column: 23, scope: !6)
!307 = !MDLocation(line: 121, column: 22, scope: !6)
!308 = !MDLocation(line: 121, column: 25, scope: !6)
!309 = !MDLocation(line: 121, column: 14, scope: !6)
!310 = !MDLocation(line: 121, column: 12, scope: !6)
!311 = !MDLocation(line: 122, column: 9, scope: !312)
!312 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 122, column: 9)
!313 = !MDLocation(line: 122, column: 16, scope: !312)
!314 = !MDLocation(line: 122, column: 9, scope: !6)
!315 = !MDLocation(line: 123, column: 7, scope: !316)
!316 = distinct !MDLexicalBlock(scope: !312, file: !1, line: 123, column: 5)
!317 = !MDLocation(line: 123, column: 60, scope: !316)
!318 = !MDLocation(line: 124, column: 23, scope: !6)
!319 = !MDLocation(line: 124, column: 24, scope: !6)
!320 = !MDLocation(line: 124, column: 15, scope: !6)
!321 = !MDLocation(line: 124, column: 13, scope: !6)
!322 = !MDLocation(line: 125, column: 9, scope: !323)
!323 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 125, column: 9)
!324 = !MDLocation(line: 125, column: 17, scope: !323)
!325 = !MDLocation(line: 125, column: 9, scope: !6)
!326 = !MDLocation(line: 126, column: 6, scope: !327)
!327 = distinct !MDLexicalBlock(scope: !323, file: !1, line: 126, column: 5)
!328 = !MDLocation(line: 126, column: 59, scope: !327)
!329 = !MDLocation(line: 127, column: 24, scope: !6)
!330 = !MDLocation(line: 127, column: 26, scope: !6)
!331 = !MDLocation(line: 127, column: 16, scope: !6)
!332 = !MDLocation(line: 127, column: 14, scope: !6)
!333 = !MDLocation(line: 128, column: 9, scope: !334)
!334 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 128, column: 9)
!335 = !MDLocation(line: 128, column: 18, scope: !334)
!336 = !MDLocation(line: 128, column: 9, scope: !6)
!337 = !MDLocation(line: 129, column: 7, scope: !338)
!338 = distinct !MDLexicalBlock(scope: !334, file: !1, line: 129, column: 5)
!339 = !MDLocation(line: 129, column: 60, scope: !338)
!340 = !MDLocation(line: 131, column: 12, scope: !6)
!341 = !MDLocation(line: 131, column: 10, scope: !6)
!342 = !MDLocation(line: 132, column: 10, scope: !6)
!343 = !MDLocation(line: 132, column: 8, scope: !6)
!344 = !MDLocation(line: 134, column: 11, scope: !345)
!345 = distinct !MDLexicalBlock(scope: !6, file: !1, line: 134, column: 5)
!346 = !MDLocation(line: 134, column: 10, scope: !345)
!347 = !MDLocation(line: 134, column: 15, scope: !348)
